import React, { useEffect, useState } from 'react';
import { ImageBackground, Text, View, StyleSheet, ScrollView, Dimensions, Image } from 'react-native';

const windowWidth = Dimensions.get('window').width;

const StoryDetails = (props) => {
    const { params } = props?.route;
    const [storyDetails, setStoryDetails] = useState({});
    const stories = [
        {
            "id": 21,
            "storyId": "29",
            "title": "૫ મિત્રની વાર્તા",
            "image": require('../../assets/storyDetailsImage/storyDetails22.png'),
            "description": "  એક સમયે, લીલી, એલેક્સ, માયા, ટોમ અને એમિલી નામના પાંચ શ્રેષ્ઠ મિત્રો હતા.  તેઓ બાળપણથી જ અવિભાજ્ય હતા, અને સમય જતાં તેમની મિત્રતા વધુ મજબૂત બની હતી.  તેઓ જાડા અને પાતળા દ્વારા હંમેશા એકબીજા માટે હતા. \n \n એક ઉનાળામાં, તેઓએ સાથે રોડ ટ્રિપ લેવાનું નક્કી કર્યું.  તેઓએ તેમની બેગ પેક કરી અને સુંદર ગ્રામ્ય વિસ્તારોની શોધખોળ માટે પ્રવાસ પર નીકળ્યા.  તેઓ રસ્તામાં વિવિધ મનોહર સ્થળોએ રોકાયા, ઘણાં બધાં ચિત્રો લીધાં અને ઘણી મજા કરી. \n \n એક સમયે, તેઓ પોતાને ગાઢ જંગલમાં ખોવાયેલા જોવા મળ્યા. તેઓ ક્યાં છે અથવા કેવી રીતે બહાર નીકળવું તેની તેમને કોઈ જાણ નહોતી.  તેઓ ગભરાવા લાગ્યા, પરંતુ પછી તેઓને યાદ આવ્યું કે તેઓ ગમે તેટલું ન હોવા છતાં કેવી રીતે હંમેશા સાથે રહે છે.  તેથી તેઓ હાથ પકડીને ચાલવા લાગ્યા, તેઓનો માર્ગ શોધવાની આશામાં. \n \n તેઓ ચાલતા જતા, તેઓએ શેર કરેલા બધા સારા સમય અને તેઓએ એકસાથે બનાવેલી બધી યાદો વિશે વાત કરી.  તેઓ હસ્યા અને મજાક કરી, તેમના આત્માને જાળવી રાખવાનો પ્રયાસ કર્યો.  છેવટે, તેઓએ આગળ પ્રકાશની ઝાંખી જોઈ, અને તેઓ તેની તરફ દોડ્યા. \n \n તેઓ થાકેલા અને પરસેવાથી લથબથ જંગલમાંથી બહાર આવ્યા પરંતુ બહાર નીકળવામાં રાહત અનુભવી.  તેઓએ એકબીજાને ચુસ્તપણે ગળે લગાવ્યા, તેમની મિત્રતા માટે આભારી અને એ હકીકત માટે કે તેઓ એકબીજાની પીઠ ધરાવે છે.  તેઓએ તેમની માર્ગ સફર ચાલુ રાખી, અને તેમ છતાં તેઓને રસ્તામાં થોડા વધુ પડકારોનો સામનો કરવો પડ્યો, તેઓએ તેમનો એકસાથે સામનો કર્યો અને પહેલા કરતા વધુ મજબૂત રીતે ઉભરી આવ્યા. \n \n વર્ષો પછી, તેઓ હજુ પણ શ્રેષ્ઠ મિત્રો તરીકે રહ્યા. તેઓ નવી યાદો બનાવવાનું ચાલુ રાખ્યું, પરંતુ તે રોડ ટ્રીપમાં તેઓએ બનાવેલી યાદોને તેઓ ક્યારેય ભૂલી શક્યા નહીં.  તેઓ જાણતા હતા કે જીવન તેમને ગમે ત્યાં લઈ જાય, તેઓ હંમેશા એકબીજા સાથે રહેશે."

        },
        {
            "id": 22,
            "storyId": "30",
            "title": "બે પાક્કા મિત્ર",
            "image": require('../../assets/storyDetailsImage/storyDetails23.png'),
            "description": "  એક સમયે, રશેલ અને સારાહ નામના બે શ્રેષ્ઠ મિત્રો હતા.  તેઓ કિન્ડરગાર્ટનથી મિત્રો હતા અને દરેક બાબતમાં સાથે રહ્યા હતા.  તેઓ અવિભાજ્ય હતા, અને દરેકને ખબર હતી કે જ્યાં એક જાય છે, બીજો પાછળ નથી \n \n એક દિવસ, રશેલને કેટલાક ખરાબ સમાચાર મળ્યા: તેણીનો પરિવાર બીજા શહેરમાં જઈ રહ્યો હતો, અને તેણીએ તેના શ્રેષ્ઠ મિત્રને પાછળ છોડીને જવું પડશે.  રાહેલ અને સારાહ પણ બરબાદ થઈ ગઈ હતી.  તેઓ રડ્યા અને એકબીજાને ગળે લગાડ્યા, જવા દેવા માંગતા ન હતા. \n \n રશેલે સારાહને વચન આપ્યું હતું કે તેઓ સંપર્કમાં રહેશે અને તેઓ હંમેશા શ્રેષ્ઠ મિત્રો રહેશે, ભલે તેઓ ગમે તેટલા દૂર હોય.  સારાહે મજબૂત બનવાનો પ્રયત્ન કર્યો, પરંતુ તેણી તેની બાજુમાં રહેલ વિના જીવનની કલ્પના કરી શકતી નથી. \n \n જેમ જેમ દિવસો વીતતા ગયા તેમ તેમ રશેલ અને સારાહ ફોન કોલ્સ, ઈમેઈલ અને પત્રો દ્વારા સંપર્કમાં રહ્યા.  તેઓએ હંમેશાની જેમ એકબીજા સાથે બધું જ શેર કર્યું.  પરંતુ જેમ જેમ સમય પસાર થતો ગયો તેમ તેમ બંનેએ નવા મિત્રો બનાવવાનું શરૂ કર્યું અને નવી પ્રવૃત્તિઓમાં જોડાઈ ગયા.  તેઓ હજી પણ એકબીજા સાથે વાત કરતા હતા, પરંતુ તે પહેલાની જેમ વારંવાર નહોતું. \n \n એક દિવસ, સારાહને સમજાયું કે તેણીએ થોડા સમય માટે રશેલ સાથે વાત કરી નથી.  તેણીએ તેને બોલાવ્યો, પરંતુ રશેલે જવાબ આપ્યો નહીં.  સારાહ ચિંતિત હતી અને આશ્ચર્ય પામી હતી કે શું તેમની મિત્રતા ઓછી થવા લાગી છે.  તેણીએ રશેલને એક પત્ર લખવાનું નક્કી કર્યું, તેણીએ તેણીને કેટલું યાદ કર્યું અને તે કેવી રીતે તેમની મિત્રતા દૂર ન થાય તે વિશે તેણીના હૃદયને ઠાલવવાનું નક્કી કર્યું. \n \n રશેલને પત્ર મળ્યો અને સારાહના શબ્દોથી તેને સ્પર્શ થયો.  તેણીને સમજાયું કે તેણી તેમની મિત્રતાની અવગણના કરી રહી છે અને તે સારાહને એટલી જ યાદ કરે છે.  તેણીએ પાછા લખ્યું, દૂર રહેવા બદલ માફી માંગી અને સંપર્કમાં રહેવાનો પ્રયાસ કરવાનું વચન આપ્યું. \n \n  તે દિવસથી, રશેલ અને સારાહે જોડાયેલા રહેવા માટે નવેસરથી પ્રયાસ કર્યા.  તેઓએ એકબીજાને નિયમિતપણે ફોન કર્યો, તેમના નવા જીવનના ફોટા શેર કર્યા અને એકબીજાની મુલાકાત લેવાની યોજના પણ બનાવી.  તેમને સમજાયું કે અંતરનો અર્થ તેમની મિત્રતાનો અંત નથી અને તેઓ હંમેશા શ્રેષ્ઠ મિત્રો રહેશે, પછી ભલે જીવન તેમને ક્યાં લઈ જાય.",

        },
        {
            "id": 23,
            "storyId": "31",
            "title": "બે પાક્કા મિત્ર ની વાર્તા",
            "image": require('../../assets/storyDetailsImage/storyDetails24.png'),
            "description": "  એક સમયે, જેક અને સારાહ નામના બે શાળાના મિત્રો હતા.  તેઓ તેમના પ્રથમ-ગ્રેડના વર્ગમાં મળ્યા અને ઝડપથી શ્રેષ્ઠ મિત્રો બની ગયા.  રમતના મેદાનમાં રમવાથી લઈને પરીક્ષા માટે ભણવા સુધીનું બધું જ તેઓએ સાથે કર્યું. \n \n જેમ જેમ તેઓ મોટા થયા તેમ, જેક અને સારાહ એકબીજાની નજીક રહ્યા, તેમ છતાં તેઓ અલગ-અલગ રુચિઓ વિકસાવવા લાગ્યા.  જેકને રમતગમતમાં રસ પડ્યો, જ્યારે સારાહને સંગીત અને કલામાં વધુ રસ હતો.  પરંતુ તેમના મતભેદોએ તેમની મિત્રતાને માત્ર મજબૂત બનાવી, કારણ કે તેઓ એકબીજાના જુસ્સા અને પ્રતિભાની પ્રશંસા કરવાનું શીખ્યા. \n \n હાઈસ્કૂલમાં, જેક અને સારાહને નવા પડકારોનો સામનો કરવો પડ્યો.  તેઓ બંનેએ શૈક્ષણિક અને અભ્યાસેતર પ્રવૃત્તિઓના દબાણ તેમજ ઉચ્ચ શાળાની સામાજિક ગતિશીલતાનો સામનો કરવો પડ્યો હતો.  પરંતુ તેઓ હંમેશા એકબીજાની પીઠ ધરાવતા હતા, જ્યારે બીજાને તેની સૌથી વધુ જરૂર હોય ત્યારે ટેકો અને પ્રોત્સાહન આપતા હતા. \n \n જ્યારે કૉલેજ માટે અરજી કરવાનો સમય આવ્યો, ત્યારે જેક અને સારાહે અલગ-અલગ શાળાઓમાં જવાનું નક્કી કર્યું.  તેઓ જાણતા હતા કે અલગ રહેવું મુશ્કેલ હશે, પરંતુ તેઓ એ પણ જાણતા હતા કે તેમની મિત્રતા અંતરને ટકી શકે તેટલી મજબૂત હતી.  તેઓએ એકબીજાની મુલાકાત લેવાની અને ફોન કોલ્સ અને વીડિયો ચેટ દ્વારા સંપર્કમાં રહેવાની યોજના બનાવી. \n \n તેમના કૉલેજના વર્ષો દરમિયાન, જેક અને સારાહ એક વ્યક્તિ તરીકે આગળ વધતા રહ્યા, પરંતુ તેઓ તેમની મિત્રતાને ક્યારેય ભૂલી શક્યા નહીં.  તેઓએ તેમના નવા અનુભવો એકબીજા સાથે શેર કર્યા અને જ્યારે જરૂર પડે ત્યારે સલાહ અને સમર્થન આપ્યું.  જ્યારે તેઓ કૉલેજમાંથી સ્નાતક થયા, ત્યારે તેઓ બંને એકબીજાની સિદ્ધિઓ પર ગર્વ અનુભવતા હતા અને ભવિષ્યમાં જે આયોજન કરે છે તેના માટે ઉત્સાહિત હતા. \n \n વર્ષો પછી, જેક અને સારાહ શ્રેષ્ઠ મિત્રો રહ્યા.  તેઓ બંને તેમની કારકિર્દીમાં સફળ હતા અને તેમના પોતાના પરિવારો હતા, પરંતુ તેમ છતાં તેઓ એકબીજા સાથે વાત કરવા અને મુલાકાત લેવા માટે સમય કાઢતા હતા.  તેઓએ તેમના શાળાના વર્ષોને પ્રેમથી જોયા, તેઓએ બનાવેલી યાદો માટે અને સમયની કસોટી પર ખરી ગયેલી મિત્રતા માટે આભારી.",

        },
        {
            "id": 24,
            "storyId": "11",
            "title": "હાથી અને કીડી ની વાર્તાઓ",
            "image": require('../../assets/storyDetailsImage/storyDetails1.png'),
            "description": "  એક સમયે એક બળવાન હાથી રહેતો હતો. તેને તેની શક્તિ અને કદ પર ખૂબ ગર્વ હતો, અને તે ઘણીવાર જંગલના અન્ય પ્રાણીઓને તેના વિશે બડાઈ મારતો હતો.\n\nએક દિવસ, જ્યારે હાથી જંગલમાંથી પસાર થઈ રહ્યો હતો, ત્યારે તેણે જોયું કે એક નાની કીડી ખોરાકનો મોટો ટુકડો લઈ જવા માટે સંઘર્ષ કરી રહી છે. હાથીને વિશ્વાસ નહોતો થતો કે આટલું નાનું પ્રાણી આટલી ભારે વસ્તુ કેવી રીતે વહન કરી શકે છે. તેણે પોતાની જાત સાથે હસીને કહ્યું, આ નાનકડી કીડીને જુઓ, તે ખોરાકનો નાનો ટુકડો લઈ જવા માટે સંઘર્ષ કરી રહી છે. હું એક પણ પરસેવો પાડ્યા વિના દસ ગણો વહન કરી શકું છું.\n\nહાથીના શબ્દો સાંભળનાર કીડીને અપમાન લાગ્યું અને તેણે હાથીને પાઠ ભણાવવાનું નક્કી કર્યું. તેથી, તેણીએ હાથીને તાકાતની કસોટી માટે પડકાર્યો. એક કીડી તેને શક્તિ પરીક્ષણ માટે પડકારતી હોવાના વિચાર પર હાથીને હસી પડ્યો પરંતુ તેણે ગમે તેમ કરીને તેની રમૂજ કરવાનું નક્કી કર્યું.\n\nહાથી આશ્ચર્યચકિત થઈ ગયો અને કીડીને પૂછ્યું કે તેણીએ ઝાડને તેટલું નબળું કેવી રીતે બનાવ્યું હશે કે તે તેને ઉખેડી શકે. કીડીએ જવાબ આપ્યો, શક્તિ હંમેશા કદ અને શક્તિથી મળતી નથી. કેટલીકવાર, તે સતત અને સખત મહેનતથી આવે છે. તમે મારા કરતા મોટા અને મજબૂત હોઈ શકો છો, પરંતુ મારી પાસે કંઈક છે જે તમારી પાસે નથી - નિશ્ચય અને દ્રઢતા.\n\nહાથીને સમજાયું કે કીડી સાચી છે અને તેના અગાઉના ઘમંડ માટે શરમ અનુભવે છે. તેણે કીડીને એક મહત્વપૂર્ણ પાઠ શીખવવા બદલ આભાર માન્યો અને તમામ જીવોનો આદર કરવાનું વચન આપ્યું, પછી ભલે તે ગમે તેટલા મોટા કે નાના હોય. તે દિવસથી, હાથી સમજદાર અને નમ્ર હાથી તરીકે જાણીતો બન્યો, અને કીડી તેની વફાદાર મિત્ર અને સલાહકાર बनी."
        },
        {
            "id": 25,
            "storyId": "12",
            "title": "સિંહ ની વાર્તાઓ",
            "image": require('../../assets/storyDetailsImage/storyDetails2.png'),
            "description": "  એક સમયે, આફ્રિકન સવાનાના હૃદયમાં, સિમ્બા નામનો એક શક્તિશાળી સિંહ રહેતો હતો. તે આખા પ્રાણી સામ્રાજ્યમાં જંગલના રાજા તરીકે જાણીતો હતો, અને તેની ભીષણ ગર્જના આસપાસ માઇલો સુધી સાંભળી શકાતી હતી.\n\nસિમ્બા એક ન્યાયી શાસક હતો અને તેની પ્રજા તેને ખૂબ માન આપતી હતી. પરંતુ એક દિવસ, હાયનાના જૂથે રાજ્યમાં મુશ્કેલી ઊભી કરવાનું શરૂ કર્યું, અન્ય પ્રાણીઓ પર હુમલો કર્યો અને તેમના ખોરાકની ચોરી કરી.\n\nસિમ્બા જાણતી હતી કે તેણે હાયનાના તોફાનને રોકવું પડશે, તેથી તેણે જંગલના તમામ પ્રાણીઓની બેઠક બોલાવી. તેણે પરિસ્થિતિ સમજાવી અને હાયનાને હરાવવામાં તેમની મદદ માંગી.\n\nશરૂઆતમાં, પ્રાણીઓ અચકાતા હતા, હાયનાના તીક્ષ્ણ દાંત અને વિકરાળ હુમલાઓથી ડરતા હતા. પરંતુ સિમ્બાએ તેમને તેમની સંખ્યાની તાકાતની યાદ અપાવી અને પોતે ચાર્જનું નેતૃત્વ કરવાનું વચન આપ્યું.\n\nસિમ્બાના સુકાન સાથે, પ્રાણીઓએ સંયુક્ત મોરચો બનાવ્યો અને યુદ્ધમાં ભાગ લીધો. હાયનાઓએ ભીષણ લડાઈ લડી, પરંતુ તેઓ સિમ્બા અને તેની સેના માટે કોઈ મેચ ન હતા. અંતે, હાયનાઓને રાજ્યમાંથી હાંકી કાઢવામાં આવ્યા, અને જંગલમાં શાંતિ પુનઃસ્થાપિત થઈ.\n\nતે દિવસથી આગળ, સિમ્બા જોખમનો સામનો કરવા માટે તેની બહાદુરી અને નેતૃત્વ માટે તેના વિષયો દ્વારા વધુ આદર અને પ્રેમ કરતા હતા. અને જંગલના પ્રાણીઓ જાણતા હતા કે તેઓ હંમેશા તેમને નુકસાનથી બચાવવા માટે તેમના શક્તિશાળી રાજા પર વિશ્વાસ કરી શકે છે."
        },
        {
            "id": 26,
            "storyId": "13",
            "title": "બિલાડી અને કૂતરા ની વાર્તાઓ ",
            "image": require('../../assets/storyDetailsImage/storyDetails3.png'),
            "description": "  એક સમયે, એક જ ઘરમાં એક બિલાડી અને એક કૂતરો રહેતા હતા. બિલાડી આળસુ હતી અને તેનો મોટાભાગનો સમય સન્ની સ્પોટમાં સૂવામાં વિતાવતો હતો, જ્યારે કૂતરો સક્રિય હતો અને તેને રમવાનું અને અન્વેષણ કરવાનું પસંદ હતું.\n\nતેમના મતભેદો હોવા છતાં, બિલાડી અને કૂતરો એકદમ સારી રીતે સાથે હતા. તેઓ ઘણીવાર અગ્નિની સામે એકસાથે નિદ્રા લેતા, અથવા ખોરાકનો બાઉલ વહેંચતા. પરંતુ ત્યાં એક વસ્તુ હતી જેના પર તેઓ સહમત ન હતા: લિવિંગ રૂમમાં આરામદાયક આર્મચેરની માલિકી.\n\nઆ કૂતરાને આર્મચેરમાં બેસીને નિદ્રા લેવાનું પસંદ હતું. પરંતુ બિલાડીની નજર તેના પર પણ હતી, તેને તેના રોજિંદા સ્નૂઝ માટે યોગ્ય સ્થળ તરીકે જોતા.\n\nએક દિવસ, જ્યારે કૂતરો આર્મચેર પર ઝડપથી સૂઈ રહ્યો હતો, ત્યારે બિલાડી તેના પર બેસી ગઈ અને પાછળના ભાગ પર કૂદી ગઈ. કૂતરો જાગી ગયો અને તેના પર ભસ્યો, તેણીને નીચે ઉતરવાનું કહ્યું. પરંતુ બિલાડીએ ઇનકાર કર્યો હતો અને દાવો કર્યો હતો કે તેણીને ખુરશી પર કૂતરા જેટલો જ અધિકાર છે.\n\nદલીલ ઘણા દિવસો સુધી ચાલુ રહી, બિલાડી અને કૂતરો ખુરશીમાં બેસીને વળાંક લઈને તેને પોતાનો દાવો કરવાનો પ્રયાસ કરી રહ્યા હતા. પણ જેમ જેમ દિવસો વીતતા ગયા તેમ તેમ બંનેને ખ્યાલ આવવા લાગ્યો કે તેમનો ઝઘડો કેટલો મૂર્ખ છે. છેવટે, તેઓ મિત્રો હતા, અને ફર્નિચરના ટુકડા પર લડવાની કોઈ જરૂર નહોતી.\n\nઅંતે, બિલાડી અને કૂતરાએ ખુરશી શેર કરવાનું નક્કી કર્યું. તેઓ તેમાં બેસીને વારાફરતી લેશે, અને જો તેમાંથી એકને તે જોઈતું હોય જ્યારે બીજો ત્યાં હતો, તો તેઓ આરામ કરવા માટે બીજી જગ્યા શોધી શકશે. તે દિવસથી, આર્મચેર તેમની મિત્રતા અને સમાધાન અને સાથે કામ કરવાની તેમની ઇચ્છાનું પ્રતીક બની ગયું.\n\nઅને તેથી બિલાડી અને કૂતરો એક જ ઘરમાં ખુશીથી રહેવાનું ચાલુ રાખ્યું, એકબીજાની કંપનીનો આનંદ માણતા અને એકબીજાની જરૂરિયાતોને માન આપતા. તેઓ શીખ્યા હતા કે કેટલીકવાર, તુચ્છ બાબત પર લડવા કરતાં શેર કરવું વધુ સારું છે."
        },
        {
            "id": 26,
            "storyId": "14",
            "title": "ઉંદર અને સિંહ ની વાર્તાઓ ",
            "image": require('../../assets/storyDetailsImage/storyDetails4.png'),
            "description": "  એક સમયે, એક નાનો ઉંદર હતો જે જંગલમાં એક છિદ્રમાં રહેતો હતો. એક દિવસ, જ્યારે તે ખોરાકની શોધમાં ફરતો હતો, ત્યારે તે આકસ્મિક રીતે એક શક્તિશાળી સિંહના પંજા પર દોડી ગયો, જે નિદ્રા લઈ રહ્યો હતો.\n\nસિંહ ગર્જના સાથે જાગી ગયો અને ઉંદરને તેના વિશાળ પંજામાં પકડી લીધો. ઉંદર, ભયથી ધ્રૂજતો, દયાની ભીખ માંગતો હતો અને વચન આપ્યું હતું કે તે સિંહ સુધી પહોંચવા માટે કંઈપણ કરશે.\n\nસિંહ, એક નાનકડા ઉંદરને મદદ કરવા સક્ષમ હોવાના વિચારથી ખુશ થઈને, ઉંદરનો જીવ બચાવવા અને તેને જવા દેવાનું નક્કી કર્યું. પરંતુ તેણે ઉંદરને ચેતવણી આપી કે તેણે ફરી ક્યારેય તેનો રસ્તો પાર ન કરવો જોઈએ.\n\nથોડા દિવસો પછી, સિંહ શિકારીની જાળમાં ફસાઈ ગયો. તેણે વેદનાથી ગર્જના કરી, પરંતુ કોઈ તેની મદદે આવ્યું નહીં. અચાનક, ઉંદર દેખાયો અને સિંહની દુર્દશા જોઈ. ખચકાટ વિના, ઉંદરે જાળના દોરડાઓ પર કૂતરવાનું શરૂ કર્યું, અને આખરે, સિંહ પોતાને મુક્ત કરવામાં સક્ષમ બન્યો.\n\nનાના ઉંદરની હિંમત અને દયા જોઈને સિંહ આશ્ચર્યચકિત થઈ ગયો. તે દિવસથી, સિંહ અને ઉંદર શ્રેષ્ઠ મિત્રો બની ગયા, અને સિંહ શીખ્યા કે નાના જીવો પણ ખૂબ મદદ કરી શકે છે.\n\nઆ વાર્તાની નૈતિકતા એ છે કે અસંભવિત સંજોગોમાં પણ દયા અને કરુણા ખૂબ આગળ વધી શકે છે."
        },
        {
            "id": 27,
            "storyId": "15",
            "title": "વાંદરો અને બિલાડી ની વાર્તાઓ",
            "image": require('../../assets/storyDetailsImage/storyDetails5.png'),
            "description": "  એક સમયે, એક ગાઢ જંગલમાં, ટિમ અને ટોમ નામના બે વાંદરાઓ અને મિટન્સ નામની બિલાડી રહેતી હતી. ટિમ અને ટોમ શ્રેષ્ઠ મિત્રો હતા અને બધું એકસાથે કર્યું હતું, જ્યારે મિટન્સ એક એકાંત બિલાડી હતી જેણે પોતાનો સમય એકલા વિતાવવાનું પસંદ કર્યું હતું.\n\nએક દિવસ, ટિમ અને ટોમ જંગલમાં રમતા હતા, અને તેઓએ એક મોટી, રસદાર કેરીને ઠોકર મારી. તેઓ બંને તેને ખાવા માંગતા હતા, પરંતુ તેમાંથી કોઈ તેને બીજા સાથે વહેંચવા માંગતા ન હતા. જેમ તેઓ કેરી પર લડવા જઈ રહ્યા હતા, મિટન્સ ક્યાંય બહાર દેખાયા અને સૂચવ્યું કે તે તેમને કેરીને સમાન રીતે વહેંચવામાં મદદ કરી શકે છે.\n\nટિમ અને ટોમ તેના વિચાર સાથે સંમત થયા, અને મિટન્સે કેરી લીધી, નજીકના ઝાડ પર ચઢી, અને તેને બે સમાન ભાગોમાં વહેંચી. તેણીએ પછી એક અડધો ટિમ અને બીજો ટોમને આપ્યો. વાંદરાઓ તેના ઉકેલથી ખુશ થયા અને તેણીની મદદ માટે આભાર માન્યો.\n\nઆ ઘટના પછી, ટિમ અને ટોમને મિટન્સની શાણપણની કિંમત સમજાઈ અને તેણે તેની સાથે મિત્રતા કરવાનું નક્કી કર્યું. તેઓએ તેણીને તેમના સાહસોમાં જોડાવા આમંત્રણ આપ્યું, અને ટૂંક સમયમાં, તેઓ શ્રેષ્ઠ મિત્રો બની ગયા.\n\nતે દિવસથી આગળ, તે ત્રણેય એક સાથે જંગલમાં ફરતા હતા, જ્યારે પણ જરૂર પડે ત્યારે એકબીજાને મદદ કરતા હતા. ટિમ અને ટોમે મિટન્સને ઝાડ પર ચડવાની અને વાંદરાની જેમ એક ડાળીથી બીજી ડાળી પર કેવી રીતે ઝૂલવું તે પણ શીખવ્યું, જ્યારે મિટેન્સે તેમને નજીકની નદીમાંથી માછલી કેવી રીતે પકડવી તે શીખવ્યું.\n\nઅંતે, બે વાંદરાઓ અને એક બિલાડી વચ્ચેની અસંભવિત મિત્રતાએ તેમને શીખવ્યું કે કેટલીકવાર, જીવનનો સૌથી મોટો ખજાનો સૌથી અણધારી જગ્યાએ મળી આવે છે, અને સાચી મિત્રતા કોઈ સીમાઓ જાણતી નથી."
        },
        {
            "id": 28,
            "storyId": "16",
            "title": "પોપટ ની વાર્તા",
            "image": require('../../assets/storyDetailsImage/storyDetails6.png'),
            "description": "  વિવિધ સંસ્કૃતિઓ અને પ્રદેશોના પોપટ વિશે ઘણી વાર્તાઓ છે, પરંતુ એક લોકપ્રિય વાર્તા એક શાણા પોપટ વિશે છે જેણે રાજાને મૂલ્યવાન પાઠ શીખવ્યો.\n\nવાર્તા કહે છે કે એક રાજા હતો જે તેના પાલતુ પોપટને ખૂબ પ્રેમ કરતો હતો. તે ઘણીવાર પોપટ સાથે વાત કરતો અને તેની સાથે તેના રહસ્યો શેર કરતો. પોપટ ખૂબ જ બુદ્ધિશાળી હતો અને તેની યાદશક્તિ તીવ્ર હતી, તેથી તે રાજા જે કહે તે બધું યાદ રાખતો.\n\nએક દિવસ, રાજા એક મહત્વપૂર્ણ બાબતને લઈને તેના સલાહકાર સાથે વિવાદમાં પડ્યો. રાજા એટલો ગુસ્સે થયો કે તેણે સલાહકારને શ્રાપ આપ્યો અને તેને મૃત્યુદંડની ધમકી આપી. નજીકમાં બેઠેલા પોપટે આ આખી વાત સાંભળી અને ખૂબ જ ચિંતામાં પડી ગયો.\n\nતે દિવસે પાછળથી, પોપટ સલાહકાર પાસે ગયો અને તેને રાજાના ક્રોધ અને શ્રાપ વિશે જણાવ્યું. સલાહકાર ચોંકી ગયો હતો અને પોપટને ચેતવણી આપવા બદલ આભારી હતો. તે તરત જ રાજ્યમાંથી ભાગી ગયો અને છુપાઈ ગયો.\n\nપોપટ રાજા સાથે રહેવાનું ચાલુ રાખ્યું, પરંતુ તે હવે તેના પર વિશ્વાસ કરતો ન હતો. જ્યારે પણ રાજા પોપટ સાથે વાત કરતો, ત્યારે તે આ શબ્દો સાથે જવાબ આપતો, \"બીજા પ્રત્યે દયાળુ બનો, જેઓ તમારી સાથે અન્યાય કરે છે તેમને માફ કરો.\" રાજાને સમજાતું નહોતું કે પોપટ આવું કેમ કહી રહ્યો છે, પરંતુ તે તેનાથી વધુને વધુ નિરાશ થયો અને આખરે તેને મારી નાખવાનો આદેશ આપ્યો.\n\nજ્યારે પોપટને ફાંસી આપવામાં આવી રહી હતી, ત્યારે તેણે રાજાને સમજાવ્યું કે તે શા માટે તે શબ્દોનું પુનરાવર્તન કરે છે. તેણે રાજાને તેની અને સલાહકાર વચ્ચે સાંભળેલી વાતચીત અને તેણે સલાહકારને કેવી રીતે ચલાવવાની ધમકી આપી તે વિશે જણાવ્યું. ત્યારે પોપટે કહ્યું, \"હું તમને દયાળુ બનો અને બીજાઓને માફ કરવા માટે યાદ કરાવું છું કારણ કે તે કરવું યોગ્ય છે. તમારે ક્યારેય તમારા ગુસ્સાને તમારા પર કાબૂ ન થવા દેવો જોઈએ અને તમારી આસપાસના લોકો પ્રત્યે હંમેશા કરુણા દર્શાવવી જોઈએ.\"\n\nપોપટના સાક્ષાત્કારથી રાજાને આઘાત અને દુ:ખ થયું. તેને સમજાયું કે તેણે એક ભયંકર ભૂલ કરી છે અને તેણે તેના માર્ગ બદલવાની જરૂર છે. તેણે પોપટની માફી માંગી અને સલાહકારને રાજ્યમાં પાછા લાવવાનો આદેશ આપ્યો.\n\nતે દિવસથી, રાજા એક દયાળુ અને ન્યાયી શાસક બન્યો, અને પોપટ તેની બાજુમાં લાંબું અને સુખી જીવન જીવ્યો, તેને અને અન્ય લોકોને દયા અને ક્ષમા વિશેના મૂલ્યવાન પાઠ શીખવ્યો."
        },
        {
            "id": 29,
            "storyId": "17",
            "title": "સાત ચકલી ની વાર્તા",
            "image": require('../../assets/storyDetailsImage/storyDetails7.png'),
            "description": "  એક સમયે, એક નાના ગામમાં સાત ચકલી રહેતી હતી. તેઓ બધા શ્રેષ્ઠ મિત્રો હતા અને તેમના દિવસો આસપાસ ઉડતા અને આનંદથી કિલબલાટ કરતા હતા.\n\nએક દિવસ, જ્યારે તેઓ બહાર રમતા હતા, ત્યારે તેઓએ જોયું કે લોકોનું એક જૂથ ગામની મધ્યમાં એક વિશાળ, સુંદર બર્ડહાઉસ બનાવે છે. ચકલીઓ નવા ઉમેરા વિશે ખૂબ જ ઉત્સાહિત હતી અને તેને તેમનું નવું ઘર બનાવવાનું નક્કી કર્યું.\n\nજો કે, જ્યારે તેઓ બર્ડહાઉસનું નિરીક્ષણ કરવા માટે ઉડાન ભર્યા, ત્યારે તેઓએ જોયું કે તે પક્ષીઓના અન્ય જૂથ દ્વારા પહેલેથી જ કબજો કરવામાં આવ્યો હતો. ચકલીઓ નિરાશ થઈ, પણ તેઓએ હાર ન માની. તેઓએ અન્ય પક્ષીઓ સાથે મિત્રતા કરવાનું અને તેમની સાથે બર્ડહાઉસ શેર કરવાનું નક્કી કર્યું.\n\nશરૂઆતમાં, અન્ય પક્ષીઓ ચકલીઓને સ્વીકારવામાં અચકાતા હતા, પરંતુ તેઓ ટૂંક સમયમાં સમજી ગયા કે ચકલી મૈત્રીપૂર્ણ અને દયાળુ છે. પક્ષીઓના બે જૂથો તેમના ખોરાક અને તેમની વાર્તાઓ વહેંચીને સુમેળમાં સાથે રહેવા લાગ્યા.\n\nજેમ જેમ સમય વીતતો ગયો તેમ તેમ ગામ સમૃદ્ધ થવા લાગ્યું અને બર્ડહાઉસ તમામ ગ્રામજનો માટે શાંતિ અને એકતાનું પ્રતીક બની ગયું. ચકલી અને અન્ય પક્ષીઓ સમુદાયને એકસાથે લાવવામાં તેમની ભૂમિકા પર ગર્વ અનુભવતા હતા.\n\nએક દિવસ, એક શક્તિશાળી વાવાઝોડું ગામમાં ત્રાટક્યું, અને બર્ડહાઉસને ભારે નુકસાન થયું. ચકલીઓ અને અન્ય પક્ષીઓએ પક્ષીગૃહનું પુનઃનિર્માણ કરવા માટે સાથે મળીને કામ કર્યું, પ્રતિકૂળ પરિસ્થિતિમાં તેમની શક્તિ અને નિશ્ચય દર્શાવ્યો.\n\nતે દિવસથી આગળ, સાત ચકલી અને તેમના પક્ષી મિત્રો બર્ડહાઉસના રક્ષક તરીકે જાણીતા બન્યા, અને તેમની મિત્રતા અને એકતાની વાર્તા પેઢી દર પેઢી પસાર થઈ."
        },
        {
            "id": 30,
            "storyId": "18",
            "title": "મોર ની વાર્તા",
            "image": require('../../assets/storyDetailsImage/storyDetails8.png'),
            "description": "  એક સમયે પીટર નામનો એક ભવ્ય મોર એક સુંદર જંગલમાં રહેતો હતો. પીટર તેના આકર્ષક સુંદર પીછાઓ માટે જાણીતો હતો જે સૂર્યપ્રકાશમાં ચમકતા હતા અને તેના ગૌરવપૂર્ણ અને આત્મવિશ્વાસુ સ્ટ્રટ માટે.\n\nએક દિવસ, જંગલમાં પ્રાણીઓનું એક જૂથ જંગલમાં સૌથી સુંદર પ્રાણી કોણ છે તે જોવા માટે એક સ્પર્ધા માટે ભેગા થયા. પીટરને ખાતરી હતી કે તે તેના અદભૂત પીછાઓને કારણે સ્પર્ધા જીતી જશે, પરંતુ જ્યારે તે સ્પર્ધામાં પહોંચ્યો ત્યારે તેણે જોયું કે એક સુંદર હરણ, એક રંગબેરંગી પતંગિયું અને એક જાજરમાન સિંહ સહિત અન્ય ઘણા સુંદર પ્રાણીઓ હતા.\n\nસ્પર્ધા શરૂ થતાં જ દરેક પ્રાણીએ પોતાની સુંદરતા પોતાની આગવી રીતે પ્રદર્શિત કરી. હરણ સુંદરતાથી ખેતરમાં દોડ્યું, પતંગિયું તેના વાઇબ્રેન્ટ રંગોથી ફરતું હતું, અને સિંહ તેની બધી શક્તિ સાથે ગર્જના કરતો હતો.\n\nબીજી બાજુ, પીટર તેના પીંછા બતાવવામાં એટલો ફસાઈ ગયો હતો કે તે તેના અન્ય ગુણો દર્શાવવાનું ભૂલી ગયો હતો. તે આજુબાજુ ફરતો હતો, તેના પીંછાઓ ઉડાડતો હતો, પરંતુ તેણે તેની અન્ય કોઈપણ કુશળતા અથવા લાક્ષણિકતાઓ દર્શાવી ન હતી.\n\nતેના આશ્ચર્ય માટે, પીટર સ્પર્ધા જીતી શક્યો ન હતો. ન્યાયાધીશોએ નોંધ્યું કે જ્યારે તેની પાસે સુંદર પીંછા હતા, ત્યારે તેની પાસે એવા અન્ય ગુણોનો અભાવ હતો જે અન્ય પ્રાણીઓને અલગ બનાવે છે. હરણમાં કૃપા અને ગતિ હતી, પતંગિયામાં રંગ અને આકર્ષકતા હતી, અને સિંહમાં શક્તિ અને બહાદુરી હતી.\n\nપીટરનું હૃદય તૂટી ગયું હતું અને તેને પોતાની જાત પર શરમ આવી હતી. તેને સમજાયું કે તે તેના બાહ્ય દેખાવ પર ખૂબ ધ્યાન કેન્દ્રિત કરી રહ્યો છે અને તેણે પોતાના અન્ય પાસાઓ વિકસાવ્યા નથી. તેણે દોડવું, ઉડવું અને ગાયન જેવી તેની અન્ય કુશળતા વિકસાવવા પર કામ કરવાનું નક્કી કર્યું.\n\nસમય જતાં, પીટર શીખ્યા કે સાચી સુંદરતા ફક્ત બાહ્ય દેખાવમાં જ નથી, પણ અંદરથી આવતા ગુણો વિશે પણ છે. તે વધુ સારી રીતે ગોળાકાર મોર બન્યો, જે જંગલના તમામ પ્રાણીઓ દ્વારા પ્રશંસા કરવામાં આવ્યો, માત્ર તેના અદભૂત પીછાઓ માટે જ નહીં પરંતુ તેની અન્ય પ્રતિભાઓ માટે પણ.\n\nતે દિવસથી, પીટર વધુ પરિપૂર્ણ જીવન જીવતો હતો, જે મિત્રોથી ઘેરાયેલો હતો જેઓ તેને પ્રેમ કરતા હતા અને તેનો આદર કરતા હતા, માત્ર તેના દેખાવ માટે જ નહીં."
        },
        {
            "id": 31,
            "storyId": "19",
            "title": "ચકી બેન અને એના બચ્ચા",
            "image": require('../../assets/storyDetailsImage/storyDetails9.png'),
            "description": "  એક સમયે, એક સ્પેરો હતી જે એક મોટા ઓકના ઝાડની ડાળી પર નાના માળામાં રહેતી હતી.  તેણીએ ઇંડાનો ક્લચ મૂક્યો હતો અને ધીરજપૂર્વક તે બહાર નીકળવાની રાહ જોઈ રહી હતી.  છેવટે, એક સન્ની સવારે, તેણીએ તેના માળામાંથી આવતો એક હલકો કિલકિલાટનો અવાજ સાંભળ્યો.  તેણીને એ જાણીને આનંદ થયો કે તેણીના ઇંડા બહાર આવ્યા છે, અને તેણીને ત્રણ સુંદર નાના બચ્ચાઓ છે.\n\nસ્પેરો તેના નાના બાળકોને જોઈને ખૂબ જ ખુશ હતી અને હંમેશા તેમને ખવડાવવામાં અને તેમને ગરમ રાખવામાં વ્યસ્ત રહેતી હતી.  બચ્ચાઓ ઝડપથી મોટા થયા અને ટૂંક સમયમાં જ તેમની નાની પાંખો ફફડાવીને માળાની આસપાસ ફરવા લાગ્યા.\n\nએક દિવસ, આ વિસ્તારમાં ભયંકર વાવાઝોડું આવ્યું.  પવન ફૂંકાઈ રહ્યો હતો, અને વરસાદ વરસી રહ્યો હતો.  સ્પેરો તેના બચ્ચાઓ વિશે ચિંતિત હતી, પરંતુ તેણે બહાદુરીથી તેમને વરસાદ અને પવનથી બચાવવા માટે તેની પાંખોથી ઢાંકી દીધા.\n\nવાવાઝોડું ચાલતું હોવાથી, પવનના એક ઝાપટાથી ઓકના ઝાડની ડાળી ઉડી ગઈ અને સ્પેરોનો માળો છૂટો પડી ગયો.  સ્પેરોએ તેના બચ્ચાઓને પકડી રાખવાનો શ્રેષ્ઠ પ્રયાસ કર્યો, પરંતુ તેઓ પવનથી વહી ગયા.\n\nસ્પેરો બરબાદ થઈ ગઈ હતી અને અસહાય અનુભવતી હતી કારણ કે તેણીએ તેના નાના બાળકોને તોફાનમાં અદૃશ્ય થતા જોયા હતા.  તેને લાગ્યું કે તે માતા તરીકે નિષ્ફળ ગઈ છે.\n\nજો કે, બીજા દિવસે સવારે, તેણીના આશ્ચર્ય અને આનંદમાં, તેણીએ તેના બચ્ચાઓને નજીકની ઝાડી નીચે એકસાથે લપેટાયેલા, સલામત અને સ્વસ્થ જોયા.  તેઓ તોફાનમાંથી બચી ગયા હતા અને તેમની માતા પાસે પાછા જવાનો રસ્તો શોધી શક્યા હતા.\n\nસ્પેરો તેના નાનાં બાળકોને ફરીથી જોઈને ખૂબ જ ખુશ થઈ ગઈ, અને તેણીને સમજાયું કે ભલે તે તેમને દરેક વસ્તુથી સુરક્ષિત ન કરી શકે, તેણીએ તેમને સુરક્ષિત રાખવા માટે શ્રેષ્ઠ પ્રયાસ કર્યો.  તેણીએ તેના બચ્ચાઓની સંભાળ રાખવાનું ચાલુ રાખ્યું અને જોયું કે તેઓ મજબૂત, સ્વસ્થ ચકલીઓમાં ઉછર્યા, માળો છોડીને પોતાનું જીવન શરૂ કરવા તૈયાર છે.\n\nતે દિવસથી, સ્પેરો જાણતી હતી કે તેણી હંમેશા તેના બચ્ચાઓને પ્રેમ કરશે અને તેનું રક્ષણ કરશે, પછી ભલે તેઓ ગમે તેટલા પડકારોનો સામનો કરે.  અને તેના નાના બાળકો જાણતા હતા કે તેઓ હંમેશા તેમની માતા પર વિશ્વાસ કરી શકે છે કે તેઓ તેમના માટે હાજર રહેશે, ભલે ગમે તે હોય."
        },
        {
            "id": 32,
            "storyId": "20",
            "title": "બે બતક ની વાર્તા",
            "image": require('../../assets/storyDetailsImage/storyDetails10.png'),
            "description": "  એક સમયે, જેક અને જીલ નામની બે બતક હતી. જેક એક ખુશ-નસીબદાર બતક હતો જેને અન્વેષણ કરવું અને રમવાનું પસંદ હતું, જ્યારે જીલ વધુ આરક્ષિત અને સાવધ હતી. તેઓ બંને લીલાછમ વૃક્ષો અને ફૂલોથી ઘેરાયેલા સુંદર તળાવમાં રહેતા હતા.\n\nએક દિવસ, જેકે નજીકની નદીનું અન્વેષણ કરવા માટે તળાવમાંથી બહાર નીકળવાનું નક્કી કર્યું. તેણે જીલને તેની સાથે આવવા માટે મનાવી, પરંતુ તે પહેલા અચકાતી હતી. જેકે તેને ખાતરી આપી કે તે રસ્તો જાણે છે અને તેઓ સુરક્ષિત રહેશે.\n\nજ્યારે તેઓ નદી તરફ આગળ વધતા હતા, ત્યારે જેકે જોયું કે બતકના એક જૂથને અંતરમાં રમતા હતા. તે તરત જ જીલને પાછળ છોડીને તેમની તરફ દોડ્યો. જીલ, અસ્વસ્થતા અનુભવતી હતી, તેણે જેકને પાછો બોલાવવાનો પ્રયાસ કર્યો, પરંતુ તે આનંદ કરવામાં ખૂબ વ્યસ્ત હતો.\n\nઅચાનક, પવનનો જોરદાર ઝાપટો ફૂંકાયો, જેના કારણે પાણી અસ્તવ્યસ્ત અને જોખમી બન્યું. જેકને ખૂબ મોડું સમજાયું કે તે તળાવથી ખૂબ દૂર ગયો હતો અને તે પાછો તરવામાં અસમર્થ હતો. જીલ, જે દૂરથી જોઈ રહી હતી, તે જાણતી હતી કે તેણે ઝડપથી કામ કરવું પડશે.\n\nખચકાટ વિના, જીલ નદીમાં કૂદી પડ્યો અને જેક તરફ તર્યો. તેણીએ તેને ચાંચથી પકડી લીધો અને તેને તળાવ તરફ ખેંચવા લાગી. તે એક સંઘર્ષ હતો, પરંતુ જીલ તેના મિત્રને બચાવવા માટે મક્કમ હતી.\n\nછેવટે, તેઓ તળાવની સલામતી માટે પાછા ફર્યા, અને જેક જીલની બહાદુરી માટે આભારી હતો. તેને સમજાયું કે તે મૂર્ખ અને બેદરકાર હતો, અને તે દિવસથી તેણે હંમેશા જીલની સલાહ સાંભળવાનું વચન આપ્યું.\n\nતે દિવસથી, જેક અને જીલ અવિભાજ્ય બની ગયા. તેઓ એકસાથે ઘણા વધુ સાહસો પર ગયા, પરંતુ આ વખતે, તેઓ હંમેશા ઘરની નજીક રહ્યા અને એકબીજાને જોવાનું સુનિશ્ચિત કર્યું."
        },
        {
            "id": 33,
            "storyId": "21",
            "title": "શાહમૃગ ની વાર્તા",
            "image": require('../../assets/storyDetailsImage/storyDetails11.png'),
            "description": "  એક સમયે, આફ્રિકન સવાન્નાહમાં, ઓલિવિયા નામનો શાહમૃગ રહેતો હતો. ઓલિવિયા લાંબા, પાતળા પગ અને રુંવાટીવાળું પ્લમેજ ધરાવતું સુંદર પક્ષી હતું જે સૂર્યમાં ચમકતું હતું.  પરંતુ તેના અદભૂત દેખાવ હોવા છતાં, ઓલિવિયાને તેની નાની પાંખો માટે અન્ય પ્રાણીઓ દ્વારા વારંવાર ચીડવવામાં આવતી હતી.\n\n એક દિવસ, જ્યારે તે ખોરાકની શોધ કરી રહી હતી,ત્યારે ઓલિવિયા સિંહોના એક જૂથને મળી જેઓ મારવા માટે લડી રહ્યા હતા. તેણીએ જોયું કે સિંહો ગર્જના કરે છે અને લડે છે, દરેક પોતાના માટે ભોજનનો દાવો કરવાનો પ્રયાસ કરે છે.\n\n ઓલિવિયા જાણતી હતી કે જો તેણીને ખાવાની તક મળવાની હોય તો તેણે ઝડપી કાર્ય કરવું પડશે.  તેણીએ તેની બધી હિંમત એકઠી કરી અને સિંહો પાસે ગઈ.\n\n તેણીના આશ્ચર્ય માટે, સિંહોએ તેના પર હુમલો કર્યો ન હતો.  તેના બદલે, તેઓ શક્તિશાળી શાહમૃગથી ડરીને પાછળ હટી ગયા.  ઓલિવિયાએ તેની તક જોઈ અને ઝડપથી ભાગતા પહેલા કિલમાંથી માંસનો ટુકડો પકડી લીધો.\n\n દૂરથી જોઈ રહેલા અન્ય પ્રાણીઓ ઓલિવિયાની બહાદુરી અને ઝડપી વિચારથી આશ્ચર્યચકિત થઈ ગયા.  તેઓ સમજી ગયા કે તેની નાની પાંખો હોવા છતાં, ઓલિવિયા એક પ્રચંડ પ્રતિસ્પર્ધી હતી.\n\n તે દિવસથી, ઓલિવિયા સવાનામાં સૌથી બહાદુર પક્ષી તરીકે જાણીતું બન્યું.  તેણીને હવે અન્ય પ્રાણીઓ તેની પાંખો માટે ચીડવતા હતા તેની પરવા કરતા નથી કારણ કે તેણી જાણતી હતી કે તેણીની પાસે અન્ય શક્તિઓ છે જેણે તેણીને અનન્ય બનાવી છે.\n\n અને તેથી, ઓલિવિયાએ સવાન્નાહમાં ફરવાનું ચાલુ રાખ્યું, ગર્વથી તેણીની સામગ્રીને હલાવી અને અન્ય તમામ પ્રાણીઓને તેની બહાદુરી અને નિશ્ચયથી પ્રેરણા આપી."
        },
        {
            "id": 33,
            "storyId": "22",
            "title": "અકબર અને બીરબલ ની વાર્તા",
            "image": require('../../assets/storyDetailsImage/storyDetails13.png'),
            "description": "  અકબર અને બીરબલ ભારતીય લોકકથાના પ્રખ્યાત પાત્રો છે જેઓ તેમની બુદ્ધિ અને શાણપણ માટે જાણીતા છે. અકબર અને બિરબલની સૌથી પ્રખ્યાત વાર્તાઓમાંની એક છે: \n\n એક દિવસ, અકબરે તેના દરબારીઓને એક પ્રશ્ન પૂછ્યો.  તેણે પૂછ્યું, કયું વધુ મહત્વનું છે, સૂર્ય કે ચંદ્ર?\n\n કેટલાક દરબારીઓએ કહ્યું કે સૂર્ય વધુ મહત્વપૂર્ણ છે કારણ કે તે પ્રકાશ અને ગરમી આપે છે અને પાક ઉગાડવામાં મદદ કરે છે.  અન્ય લોકોએ કહ્યું કે ચંદ્ર વધુ મહત્વપૂર્ણ છે કારણ કે તે ભરતીને નિયંત્રિત કરે છે અને નેવિગેશનમાં મદદ કરે છે.\n\n બીરબલે દરેકની દલીલો ધ્યાનથી સાંભળી અને પછી કહ્યું, મહારાજ, સૂર્ય અને ચંદ્ર બંને પોતપોતાની રીતે મહત્વપૂર્ણ છે. પરંતુ મને લાગે છે કે તમારા પ્રશ્નનો જવાબ સરળ છે. તે ચંદ્ર છે જે વધુ મહત્વપૂર્ણ છે.\n\n અકબરને આશ્ચર્ય થયું અને પૂછ્યું, બીરબલ, તું આવું કેમ વિચારે છે?\n\n બીરબલે જવાબ આપ્યો, મહારાજ, સૂર્ય દિવસ દરમિયાન ચમકે છે જ્યારે દરેક વ્યક્તિ જાગતો હોય છે અને વ્યસ્ત હોય છે. પરંતુ ચંદ્ર રાત્રે ત્યારે ચમકે છે જ્યારે બધા સૂતા હોય છે અને જે લોકોને તેની સૌથી વધુ જરૂર હોય છે તેમને તે પ્રકાશ આપે છે. ચંદ્ર ઠંડીમાં પણ મદદ કરે છે.  ગરમ દિવસ પછી પૃથ્વી. તેથી, મને લાગે છે કે ચંદ્ર વધુ મહત્વપૂર્ણ છે. \n\n અકબર બીરબલના તર્કથી પ્રભાવિત થયો અને તેને ચર્ચાનો વિજેતા જાહેર કર્યો.\n\n  આ વાર્તા બીરબલની બુદ્ધિમત્તા અને બોક્સની બહાર વિચારવાની તેની ક્ષમતા દર્શાવે છે. તે લોકપ્રિય અભિપ્રાયની વિરુદ્ધ જવા અને સમસ્યાઓના ઉકેલ માટે પોતાના તર્કનો ઉપયોગ કરવામાં ડરતો ન હતો."
        },
        {
            "id": 34,
            "storyId": "23",
            "title": "એક નાનકડા ગામમાં",
            "image": require('../../assets/storyDetailsImage/storyDetails14.png'),
            "description": "  એક નાનકડા ગામમાં પહાડો અને લીલાછમ ખેતરો વચ્ચે વસેલા ખેડૂતો, કારીગરો અને પરિવારોનો એક ચુસ્ત સમુદાય રહેતો હતો.  ગામડામાં જીવન સાદું અને શાંતિપૂર્ણ હતું, દરેક જણ જમીનની સંભાળ રાખવા, તેમના પ્રાણીઓની સંભાળ રાખવા અને તેમના બાળકોને ઉછેરવા માટે સાથે મળીને કામ કરતા હતા.\n\n  એક દિવસ ગામમાં એક નવું કુટુંબ આવ્યું.  તેઓ પ્રવાસી હતા, તેઓને પોતાનું નામ આપવા માટે કોઈ ઘર ન હતું, અને તેઓએ સાંભળ્યું હતું કે ગામ એક આવકારદાયક સ્થળ છે જ્યાં તેઓ આશ્રય મેળવી શકે છે.  ગ્રામજનો, તેમની પ્રતિષ્ઠા માટે સાચા, પરિવારને અંદર લઈ ગયા અને તેમને ઘરની અનુભૂતિ કરાવી.  તેઓએ તેમનો ખોરાક, તેમની વાર્તાઓ અને તેમની કુશળતા નવા આવનારાઓ સાથે શેર કરી, અને લાંબા સમય પહેલા, પ્રવાસીઓ સમુદાયનો એક ભાગ બની ગયા હતા.\n\n પરંતુ જેમ જેમ અઠવાડિયા મહિનાઓમાં ફેરવાતા ગયા તેમ તેમ ગામના કેટલાક લોકો બડબડ કરવા લાગ્યા.  તેઓ ચિંતિત હતા કે નવા આવનારાઓ કદાચ તેમના પોતાના પરિવારો અને વ્યવસાયોથી સંસાધનો અને ધ્યાન દૂર લઈ રહ્યા છે.  તેઓએ બંધ દરવાજા પાછળ વાત કરવાનું શરૂ કર્યું અને પ્રવાસીઓને ભગાડવાની યોજના બનાવી.\n\n  એક રાત્રે, ગ્રામજનોનું એક જૂથ પ્રવાસીઓની ઝૂંપડીની બહાર એકત્ર થયું, અપમાનની બૂમો પાડી અને હિંસાની ધમકી આપી.  પ્રવાસીઓ અંદર ઘૂસી ગયા, ભયભીત અને મૂંઝવણમાં, આશ્ચર્ય પામ્યા કે તેઓએ શું ખોટું કર્યું છે.  પણ પછી, કંઈક અણધાર્યું બન્યું.  ગામના બાકીના લોકો, જેમણે હંગામો સાંભળ્યો હતો, તેઓ તેમના ઘરોમાંથી બહાર આવ્યા અને મુસાફરોની આસપાસ એક રક્ષણાત્મક વર્તુળ બનાવ્યું.  તેઓ ગુંડાઓ વિરુદ્ધ બોલ્યા, તેમને યાદ અપાવ્યું કે ગામ હંમેશા દયા અને કરુણાનું સ્થાન રહ્યું છે.\n\n  ગુંડાઓ, તેમના પડોશીઓના સામૂહિક આક્રોશથી શરમાઈને, અંધકારમાં સરી પડ્યા.  પ્રવાસીઓ, કૃતજ્ઞ અને નમ્રતાપૂર્વક, તેમના સમર્થન માટે ગ્રામજનોનો આભાર માન્યો અને તેમના પ્રત્યે જે દયા દર્શાવવામાં આવી હતી તે હંમેશા યાદ રાખવાની પ્રતિજ્ઞા લીધી.\n\n  અને તેથી ગામ ચાલુ રહ્યું, તેની ઉદારતા અને આતિથ્યની પરંપરાઓ તેના રહેવાસીઓની ક્રિયાઓ દ્વારા સાચવવામાં આવી.  પ્રવાસીઓ સમુદાયના મૂલ્યવાન સભ્યો બન્યા, અને તમામ ગ્રામજનો વચ્ચેના બંધન પહેલા કરતાં વધુ મજબૂત બન્યા.  તે યાદ અપાવતું હતું કે નાના ગામમાં પણ દયા અને એકતાની શક્તિ પૂર્વગ્રહ અને નફરતના સૌથી કપટી સ્વરૂપોને પણ દૂર કરી શકે છે."
        },
        {
            "id": 35,
            "storyId": "24",
            "title": "બે રાજકુમાર ની વાર્તા ",
            "image": require('../../assets/storyDetailsImage/storyDetails15.png'),
            "description": "  એક સમયે, દૂર એક રાજ્યમાં, બે રાજકુમારો હતા.  મોટા રાજકુમારનું નામ એલેક્ઝાન્ડર હતું, અને નાના રાજકુમારનું નામ બેન્જામિન હતું.  તેઓ ઘણી રીતે એકબીજાથી ખૂબ જ અલગ હતા.\n\n  એલેક્ઝાન્ડર મજબૂત, બહાદુર અને સાહસિક હતો.  તેને સામ્રાજ્યની શોધખોળ કરવી અને સાહસિક સાહસો પર જવાનું પસંદ હતું.  બીજી બાજુ, બેન્જામિન વધુ અનામત અને વિચારશીલ હતા.  તેમને પુસ્તકો અને ભણતરનો શોખ હતો અને તેમનો મોટાભાગનો સમય પુસ્તકાલયમાં અભ્યાસ કરવામાં વિતાવતો હતો.\n\n  તેમના મતભેદો હોવા છતાં, એલેક્ઝાન્ડર અને બેન્જામિન ખૂબ નજીક હતા.  તેઓ એકબીજાને ઊંડો પ્રેમ કરતા હતા અને ગમે તે હોય એકબીજાને ટેકો આપતા હતા.\n\n  એક દિવસ, રાજ્યમાં એક મહાન ડ્રેગન દેખાયો.  તે લોકોને આતંકિત કરી રહ્યો હતો અને તેના માર્ગમાંની દરેક વસ્તુનો નાશ કરી રહ્યો હતો.  રાજાએ તેના પુત્રોને ડ્રેગનને હરાવવા અને રાજ્યને બચાવવા માટે મદદ કરવા બોલાવ્યા.\n\n એલેક્ઝાંડરે તરત જ ચાર્જનું નેતૃત્વ કરવા માટે સ્વૈચ્છિક સેવા આપી.  તેણે તેના સૌથી બહાદુર સૈનિકોને એકઠા કર્યા અને ડ્રેગનને મારવા નીકળી પડ્યા.  જોકે, બેન્જામિનનો વિચાર અલગ હતો.  તેણે લાઇબ્રેરીમાં કલાકો સુધી ડ્રેગન પર સંશોધન કરવામાં અને તેને હરાવવાનો માર્ગ શોધવાનો પ્રયાસ કર્યો.\n\n  અંતે, બેન્જામિનને ડ્રેગનના બખ્તરમાં નબળાઈ મળી.  તેને સમજાયું કે ડ્રેગનના હૃદયની નજીક એક સંવેદનશીલ સ્થળ છે.  બેન્જામિનએ ઝડપથી એલેક્ઝાન્ડરને એક પત્ર લખ્યો, તેને ડ્રેગનની નબળાઈ વિશે જણાવ્યું અને તેને તે ખૂણાથી તેના પર હુમલો કરવા વિનંતી કરી.\n\n  એલેક્ઝાંડરને પત્ર મળ્યો અને તેને ધ્યાનથી વાંચ્યો.  તેને સમજાયું કે બેન્જામિનની યોજના અજગરને હરાવવાનો શ્રેષ્ઠ માર્ગ હતો.  તેણે તેના સૈનિકોને ભેગા કર્યા અને સંવેદનશીલ સ્થળેથી ડ્રેગન પર હુમલો કર્યો.  બેન્જામિનની મદદથી, તેઓ ડ્રેગનને મારી નાખવામાં અને રાજ્યને બચાવવા સક્ષમ હતા.\n\n  રાજ્યના લોકો એલેક્ઝાન્ડર અને બેન્જામિનને હીરો તરીકે ઉજવતા હતા.  તેઓએ એલેક્ઝાન્ડરની બહાદુરી માટે અને બેન્જામિનની તેની બુદ્ધિ અને શાણપણ માટે પ્રશંસા કરી.  તે દિવસથી આગળ, એલેક્ઝાન્ડર અને બેન્જામિન તેમના સામ્રાજ્યને સુરક્ષિત કરવા અને સેવા આપવા માટે સાથે મળીને કામ કર્યું, તેમની અલગ-અલગ શક્તિઓનો ઉપયોગ કરીને રાજ્યને બધા માટે વધુ સારું સ્થાન બનાવ્યું."
        },
        {
            "id": 36,
            "storyId": "25",
            "title": "રાજા રાણી ની વાર્તા",
            "image": require('../../assets/storyDetailsImage/storyDetails16.png'),
            "description": "  એક સમયે, એક દૂરના રાજ્યમાં, એક નાનો રાજકુમાર અને એક નાની રાજકુમારી રહેતી હતી.  રાજકુમાર એક ટેકરીની ટોચ પર એક ભવ્ય કિલ્લામાં રહેતો હતો, જ્યારે રાજકુમારી રાજ્યના હૃદયમાં એક સુંદર મહેલમાં રહેતી હતી.\n\n  એક દિવસ, નાના રાજકુમારે સામ્રાજ્યની શોધખોળ કરવા માટે સાહસ પર જવાનું નક્કી કર્યું.  તેણે તેના શ્રેષ્ઠ વસ્ત્રો પહેર્યા અને તેની મુસાફરી પર પ્રયાણ કર્યું.  તે ચાલતો હતો ત્યારે તેને રમતા બાળકોના જૂથ સામે આવ્યો.  તે તેમની રમતમાં જોડાયો, અને તેઓએ ખુલ્લા હાથે તેનું સ્વાગત કર્યું.  તેઓ કલાકો સુધી સાથે રમતા હતા, અને નાના રાજકુમાર પાસે તેના જીવનનો સમય હતો.\n\n  દરમિયાન, નાની રાજકુમારી તેના મહેલમાં કંટાળો અનુભવી રહી હતી.  તેણી પાસે બધા રમકડાં અને પુસ્તકો હતા જે તેણીને ક્યારેય જોઈતી હતી, પરંતુ તેણી થોડી ઉત્તેજના માટે ઝંખતી હતી.  તેણીએ નાના રાજકુમારની જેમ જ બહાર જઈને રાજ્યનું અન્વેષણ કરવાનું નક્કી કર્યું.\n\n  જ્યારે તેણી આસપાસ ભટકતી હતી, ત્યારે તેણીએ ખેતરમાં ફૂલો રોપતા ગામના લોકોના જૂથને ઠોકર મારી.  તેઓએ તેનું સ્વાગત કર્યું અને તેને ફૂલો કેવી રીતે રોપવા તે બતાવ્યું.  નાની રાજકુમારીને તે એટલું ગમ્યું કે તેણે રહેવાનું અને તેમને મદદ કરવાનું નક્કી કર્યું.\n\n  નાના રાજકુમાર અને રાજકુમારીએ સમગ્ર રાજ્યમાં તેમના સાહસો ચાલુ રાખ્યા.  તેઓ જુદા જુદા લોકોને મળ્યા, નવા સ્થળોની શોધખોળ કરી અને ખૂબ મજા કરી.  તેઓ બંને શીખ્યા કે જીવનમાં સૌથી મહત્વની બાબત એ છે કે દયાળુ બનવું અને મિત્રો બનાવવું.\n\n  જ્યારે તેઓ તેમના કિલ્લાઓ પર પાછા ફર્યા, ત્યારે તેઓ એકબીજાને તેમના સાહસો વિશે કહેવા માટે રાહ જોઈ શક્યા નહીં.  તેમને સમજાયું કે તેઓ બંનેએ મૂલ્યવાન પાઠ શીખ્યા છે, અને તેઓએ હંમેશા એકબીજા માટે હાજર રહેવાનું અને સાથે મળીને વિશ્વનું અન્વેષણ કરવાનું ચાલુ રાખવાનું વચન આપ્યું હતું.\n\n  તે દિવસથી, નાનો રાજકુમાર અને રાજકુમારી શ્રેષ્ઠ મિત્રો બની ગયા.  તેઓએ રાજ્યનું અન્વેષણ કરવાનું ચાલુ રાખ્યું અને સાથે મળીને ઘણા વધુ સાહસો કર્યા.  અને રાજ્યમાં દરેક જણ જાણતા હતા કે તેઓ જીવનભરના મિત્રો બનવાના હતા."
        },
        {
            "id": 37,
            "storyId": "26",
            "title": "ખેડૂત અને ગાય ની વાર્તા",
            "image": require('../../assets/storyDetailsImage/storyDetails17.png'),
            "description": "  એક સમયે એક ખેડૂત હતો જેની પાસે ગાય હતી.  ગાય ખેડૂતની સૌથી કિંમતી સંપત્તિ હતી, કારણ કે તે તેને દૂધ પૂરું પાડતી હતી, જેને તે આજીવિકા માટે નજીકના બજારમાં વેચતો હતો.\n\n  એક દિવસ, ખેડૂત સવારે વહેલો ઉઠ્યો અને ગાયને દૂધ આપવા કોઠારમાં ગયો.  જો કે ગાય ગાયબ હોવાનું તેમને જાણવા મળ્યું હતું.  તેણે બધે શોધખોળ કરી પણ તે મળી ન હતી.  ખેડૂત ખૂબ જ ચિંતિત હતો કારણ કે ગાય તેની આવકનું એકમાત્ર સાધન હતું.\n\n  જ્યારે તે ખેતરોમાંથી પસાર થઈ રહ્યો હતો, ત્યારે તેણે દૂરથી એક હલકો અવાજ સાંભળ્યો.  અવાજને પગલે તે નજીકના તળાવ તરફ આવ્યો, જ્યાં તેણે ગાયને કાદવમાં ફસાયેલી જોઈ.  ખેડૂત તરત જ ગાયને બચાવવા દોડી ગયો અને તેને કાદવમાંથી બહાર કાઢ્યો.\n\n  ગાય થાકેલી અને નબળી હતી, તેથી ખેડૂતે તેને ઘરે લઈ જવા અને તેની સંભાળ લેવાનું નક્કી કર્યું.  તેણે તેણીને ખોરાક, પાણી અને આશ્રય આપ્યો અને ખાતરી કરી કે તેણી આરામદાયક છે.  તે તેના પર નજર રાખવા માટે આખી રાત પણ જાગી રહ્યો હતો.\n\n  થોડા દિવસો પછી, ગાય ફરીથી તેની શક્તિ પ્રાપ્ત કરી અને ફરીથી દૂધ ઉત્પન્ન કરવામાં સક્ષમ થઈ.  ખેડુત પોતાની ગાય પાછી મળવાથી ખુશ અને આભારી હતો.  તે દિવસથી, તેણે તેની ગાયની વધુ સારી રીતે કાળજી લેવાનું અને તેને ફરી ક્યારેય ભટકી ન જવા દેવાનું વચન આપ્યું.\n\n  બદલામાં, ગાય પણ ખેડૂત સાથે વધુ જોડાયેલી બની ગઈ અને તે જ્યાં પણ જાય ત્યાં તેની આસપાસ તેની પાછળ ચાલતી.  તેઓએ એક વિશિષ્ટ બંધન વિકસાવ્યું હતું જે ક્યારેય તૂટશે નહીં.\n\n  અને તેથી, ખેડૂત અને તેની ગાય સુખેથી જીવતા હતા, આજીવિકા માટે સાથે કામ કરતા હતા અને એકબીજાની કંપનીનો આનંદ માણતા હતા."
        },
        {
            "id": 38,
            "storyId": "27",
            "title": "રાજા ના મહેલ માં હુમલો થયો",
            "image": require('../../assets/storyDetailsImage/storyDetails18.png'),
            "description": "  એક સમયે, એક મહાન રાજા હતો જે વિશાળ રાજ્ય પર શાસન કરતો હતો.  એક દિવસ, રાજાને સમાચાર મળ્યા કે પડોશી રાજ્યએ તેના રાજ્ય સામે યુદ્ધની ઘોષણા કરી છે.  રાજા જાણતો હતો કે તેણે તેના લોકો અને તેની જમીનની સુરક્ષા માટે ઝડપથી કાર્યવાહી કરવી પડશે.\n\n  રાજાએ તરત જ તેના સલાહકારો અને સેનાપતિઓને પરિસ્થિતિની ચર્ચા કરવા બોલાવ્યા.  તેઓએ શ્રેષ્ઠ કાર્યવાહી અંગે ચર્ચા કરી અને આખરે નિર્ણય લીધો કે રાજાએ પોતાની સેનાને યુદ્ધમાં જાતે જ લઈ જવી જોઈએ.  રાજા સંમત થયા, એ જાણીને કે તેની હાજરી તેના સૈનિકોને પ્રેરણા આપશે અને તેના દુશ્મનોને બતાવશે કે તે તેના રાજ્ય માટે લડવામાં ડરતો નથી.\n\n  રાજાએ તેનું બખ્તર પહેર્યું અને તેના ઘોડા પર બેસાડ્યો, તેના સૈન્યને કિલ્લાના દરવાજામાંથી બહાર લઈ જઈને યુદ્ધમાં લઈ ગયો.  તલવારો અને ઢાલની અથડામણ ખીણમાં ગુંજતી હતી કારણ કે યુદ્ધના મેદાનમાં બંને સેનાઓ સામસામે આવી હતી.\n\n  યુદ્ધ લાંબુ અને ઘાતકી હતું, પરંતુ રાજાની સેના સારી રીતે પ્રશિક્ષિત અને સુસજ્જ હતી.  તેઓ ભયંકર રીતે લડ્યા, અને રાજાએ ખૂબ હિંમત અને નિશ્ચય સાથે તેમનું નેતૃત્વ કર્યું.  દુશ્મનના શ્રેષ્ઠ પ્રયાસો છતાં, રાજાની સેના વિજયી બની.\n\n  જેમ જેમ રાજા તેના કિલ્લામાં પાછો ફર્યો, ત્યારે તેના લોકો દ્વારા તેને હીરો તરીકે બિરદાવવામાં આવ્યો.  તેણે પોતાની જાતને એક શાણા અને મજબૂત નેતા તરીકે સાબિત કરી હતી, તે પોતાના સામ્રાજ્યને બચાવવા માટે પોતાને નુકસાન પહોંચાડવા તૈયાર હતો.  તે દિવસથી આગળ, રાજા એક મહાન યોદ્ધા રાજા તરીકે જાણીતો હતો, અને તેના શાસન હેઠળ આવતા ઘણા વર્ષો સુધી તેનું રાજ્ય સમૃદ્ધ થયું."
        },
        {
            "id": 39,
            "storyId": "28",
            "title": "રાજા શિકાર પર ગયા",
            "image": require('../../assets/storyDetailsImage/storyDetails19.png'),
            "description": "  એક સમયે એક રાજા હતો જેને શિકારનો શોખ હતો.  તે ઘણીવાર પોતાના ધનુષ અને તીર વડે જંગલી પ્રાણીઓનો શિકાર કરવા જંગલમાં ઊંડે સુધી જતો હતો.\n\n  એક દિવસ, રાજા એકલો શિકાર પ્રવાસે ગયો.  તે જંગલમાં ઊંડે સુધી ભટકતો હતો, તેણે એક સુંદર હરણનો પીછો કર્યો હતો જેને તેણે જોયું હતું.  રાજાએ કલાકો સુધી હરણનો પીછો કર્યો, જ્યાં સુધી તે તેની દૃષ્ટિ ગુમાવી બેઠો.\n\n  તેણે આજુબાજુ જોયું તેમ, રાજાને સમજાયું કે તે તેના મહેલથી ખૂબ દૂર ભટકી ગયો છે અને તેને કેવી રીતે પાછા ફરવું તેની કોઈ જાણ નથી.  બાબતોને વધુ ખરાબ કરવા માટે, તેની પાસે ખોરાક અને પાણી પણ સમાપ્ત થઈ ગયું હતું.\n\n  જંગલમાં ભૂખ અને તરસથી મરી જશે એવા ભયથી રાજા ગભરાવા લાગ્યો.  પણ તે આશા છોડવા જ જતો હતો ત્યાં તેણે દૂર એક નાનકડી ઝૂંપડી જોઈ.\n\n  તે ઝૂંપડી તરફ ચાલ્યો અને બહાર એક વૃદ્ધ સ્ત્રી બેઠેલી જોવા મળી.  રાજાએ તેણીને તેની પરિસ્થિતિ સમજાવી અને ખોરાક અને પાણીની વિનંતી કરી.\n\n  વૃદ્ધ સ્ત્રીને રાજા પર દયા આવી અને તેને અંદર બોલાવ્યો.  તેણીએ તેને ખોરાક અને પાણી આપ્યું અને તેને થોડો સમય આરામ કરવા દીધો.  રાજા બેઠો અને આરામ કરતો હતો ત્યારે તેણે જોયું કે વૃદ્ધ સ્ત્રી પાસે એક સુંદર હાર હતો.\n\n  તેણે તેણીને ગળાનો હાર વિશે પૂછ્યું અને વૃદ્ધ મહિલાએ જવાબ આપ્યો કે તે કુટુંબનો વારસો છે જે પેઢીઓથી પસાર થતો હતો.  રાજા ગળાનો હારથી એટલો પ્રભાવિત થયો કે તેણે વૃદ્ધ સ્ત્રીને પૂછ્યું કે શું તે તેને તેને વેચશે?\n\n  વૃદ્ધ સ્ત્રીએ ના પાડી, રાજાને કહ્યું કે હાર વેચવા માટે ખૂબ કિંમતી છે.  પરંતુ રાજા તે મેળવવા માટે મક્કમ હતા, અને તેણે વૃદ્ધ સ્ત્રીને તેના માટે મોટી રકમ ચૂકવવાની ઓફર કરી.\n\n વૃદ્ધ સ્ત્રી આખરે રાજાને હાર વેચવા સંમત થઈ, પરંતુ તેની એક શરત હતી.  તેણીએ રાજાને વચન આપવા કહ્યું કે તેણીએ તેના પર જે દયા બતાવી છે તે તે ક્યારેય ભૂલી શકશે નહીં અને હંમેશા જરૂરિયાતમંદોને મદદ કરશે.\n\n  રાજાએ વચન પાળવાનું વચન આપ્યું અને વૃદ્ધ સ્ત્રી પાસેથી ગળાનો હાર ખરીદ્યો.  તે પછી તેણે તેના મહેલમાં પાછા ફરવાનો રસ્તો શોધી કાઢ્યો, અને તેણે તેની પ્રજા પ્રત્યે દયાળુ અને ઉદાર બનીને પોતાનું વચન પાળ્યું.\n\n તે દિવસથી, રાજા શીખ્યા કે જીવનનું સાચું મૂલ્ય ભૌતિક સંપત્તિમાં નથી, પરંતુ આપણે અન્ય લોકો પ્રત્યે જે દયા બતાવીએ છીએ તેમાં રહેલું છે.  અને તેણે બાકીનું જીવન ન્યાયી અને દયાળુ શાસક તરીકે જીવ્યું."
        },
        {
            "id": 40,
            "storyId": "32",
            "title": "સ્કૂલ ફ્રેન્ડ ની વાર્તા",
            "image": require('../../assets/storyDetailsImage/storyDetails25.png'),
            "description": "  એક સમયે, જેક અને સારાહ નામના બે શાળાના મિત્રો હતા.  તેઓ તેમના પ્રથમ-ગ્રેડના વર્ગમાં મળ્યા અને ઝડપથી શ્રેષ્ઠ મિત્રો બની ગયા.  રમતના મેદાનમાં રમવાથી લઈને પરીક્ષા માટે ભણવા સુધીનું બધું જ તેઓએ સાથે કર્યું.\n\n  જેમ જેમ તેઓ મોટા થયા તેમ, જેક અને સારાહ એકબીજાની નજીક રહ્યા, તેમ છતાં તેઓ અલગ-અલગ રુચિઓ વિકસાવવા લાગ્યા.  જેકને રમતગમતમાં રસ પડ્યો, જ્યારે સારાહને સંગીત અને કલામાં વધુ રસ હતો.  પરંતુ તેમના મતભેદોએ તેમની મિત્રતાને માત્ર મજબૂત બનાવી, કારણ કે તેઓ એકબીજાના જુસ્સા અને પ્રતિભાની પ્રશંસા કરવાનું શીખ્યા.\n\n  હાઈસ્કૂલમાં, જેક અને સારાહને નવા પડકારોનો સામનો કરવો પડ્યો.  તેઓ બંનેએ શૈક્ષણિક અને અભ્યાસેતર પ્રવૃત્તિઓના દબાણ તેમજ ઉચ્ચ શાળાની સામાજિક ગતિશીલતાનો સામનો કરવો પડ્યો હતો.  પરંતુ તેઓ હંમેશા એકબીજાની પીઠ ધરાવતા હતા, જ્યારે બીજાને તેની સૌથી વધુ જરૂર હોય ત્યારે ટેકો અને પ્રોત્સાહન આપતા હતા.\n\n  જ્યારે કૉલેજ માટે અરજી કરવાનો સમય આવ્યો, ત્યારે જેક અને સારાહે અલગ-અલગ શાળાઓમાં જવાનું નક્કી કર્યું.  તેઓ જાણતા હતા કે અલગ રહેવું મુશ્કેલ હશે, પરંતુ તેઓ એ પણ જાણતા હતા કે તેમની મિત્રતા અંતરને ટકી શકે તેટલી મજબૂત હતી.  તેઓએ એકબીજાની મુલાકાત લેવાની અને ફોન કોલ્સ અને વીડિયો ચેટ દ્વારા સંપર્કમાં રહેવાની યોજના બનાવી.\n\n  તેમના કૉલેજના વર્ષો દરમિયાન, જેક અને સારાહ એક વ્યક્તિ તરીકે આગળ વધતા રહ્યા, પરંતુ તેઓ તેમની મિત્રતાને ક્યારેય ભૂલી શક્યા નહીં.  તેઓએ તેમના નવા અનુભવો એકબીજા સાથે શેર કર્યા અને જ્યારે જરૂર પડે ત્યારે સલાહ અને સમર્થન આપ્યું.  જ્યારે તેઓ કૉલેજમાંથી સ્નાતક થયા, ત્યારે તેઓ બંને એકબીજાની સિદ્ધિઓ પર ગર્વ અનુભવતા હતા અને ભવિષ્યમાં જે આયોજન કરે છે તેના માટે ઉત્સાહિત હતા.\n\n  વર્ષો પછી, જેક અને સારાહ શ્રેષ્ઠ મિત્રો રહ્યા.  તેઓ બંને તેમની કારકિર્દીમાં સફળ હતા અને તેમના પોતાના પરિવારો હતા, પરંતુ તેમ છતાં તેઓ એકબીજા સાથે વાત કરવા અને મુલાકાત લેવા માટે સમય કાઢતા હતા.  તેઓએ તેમના શાળાના વર્ષોને પ્રેમથી જોયા, તેઓએ બનાવેલી યાદો માટે અને સમયની કસોટી પર ખરી ગયેલી મિત્રતા માટે આભારી."
        },
        {
            "id": 40,
            "storyId": "33",
            "title": "ફરેન્ડશીપ મસ્તી",
            "image": require('../../assets/storyDetailsImage/storyDetails26.png'),
            "description": "  કાર ધોવાની દુર્ઘટના એક દિવસ, \n  બે શ્રેષ્ઠ મિત્રો, એલેક્સ અને મેક્સે એલેક્સની કાર ધોવાનું નક્કી કર્યું.  તેઓ કાર ધોવા તરફ ગયા અને કાર પર સાબુ અને પાણી છાંટવાનું શરૂ કર્યું.  પરંતુ જ્યારે તેઓ કાર સાફ કરી રહ્યા હતા, ત્યારે તેઓ અકસ્માતે નળી વડે એકબીજાને છાંટતા, એકબીજાને ભીંજવી દીધા હતા.\n\n  તેઓ હસવા લાગ્યા અને કાર ધોવાની આસપાસ એકબીજાનો પીછો કરવા લાગ્યા, એકબીજા પર પાણીના છાંટા પાડ્યા.  એક સમયે, મેક્સ ખાબોચિયા પર લપસી ગયો અને સાબુવાળા પાણીની ડોલમાં પડ્યો, જેના કારણે એલેક્સ વધુ સખત હસવા લાગ્યો.  તેના અંત સુધીમાં, તેઓ બંને ભીંજાઈ ગયા હતા અને સાબુથી ઢંકાઈ ગયા હતા, પરંતુ તેઓએ આ પહેલા ક્યારેય કાર ધોવાની આટલી મજા નહોતી કરી.\n\n  ધ પ્રૅન્ક ફોન કૉલ બે તોફાની મિત્રો, એમિલી અને ટોમે, તેમના અન્ય મિત્ર, લીલી પર ટીખળ રમવાનું નક્કી કર્યું.  તેઓએ તેણીને પિઝા ડિલિવરી હોવાનો ડોળ કરીને બોલાવ્યા અને વધારાના ચીઝ સાથે મોટા પેપેરોની પિઝાનો ઓર્ડર લીધો.\n\n  જ્યારે લીલીએ એ સરનામું પૂછ્યું કે જ્યાં પિઝા ડિલિવરી કરવી જોઈએ, ત્યારે એમિલી અને ટોમે તેને નજીકના પાર્કનું સરનામું આપ્યું.  જ્યારે પિઝા દેખાતો ન હતો ત્યારે તેઓ લીલીની મૂંઝવણની કલ્પના કરતા હોવાથી તેઓ હસ્યા.\n\n  પરંતુ તેઓ અટકી જવાના હતા ત્યારે લીલીએ કહ્યું, રાહ જુઓ, હું અત્યારે પાર્કમાં છું. શું તમે મારા માટે પિઝા અહીં લાવી શકશો?  એમિલી અને ટોમ થીજી ગયા, એ સમજીને કે તેમની ટીખળ બેકફાયર થઈ ગઈ હતી.  તેઓ ઝડપથી એક પ્લાન લઈને આવ્યા અને હાથમાં પિઝા લઈને પાર્ક તરફ ગયા.\n\n જેમ જેમ તેઓ લીલીની નજીક પહોંચ્યા, તેઓએ બૂમ પાડી, આશ્ચર્ય!  લીલીને જ્યારે ખબર પડી કે શું થયું છે ત્યારે હસી પડી.  તેઓ બધા ઘાસ પર બેઠા અને પાર્કમાં તેમની અણધારી પિઝા પિકનિકનો આનંદ માણ્યો.  એમિલી અને ટોમને જાણવા મળ્યું કે કેટલીકવાર, શ્રેષ્ઠ-નિર્ધારિત ટીખળો પણ અણધાર્યા પરિણામો લાવી શકે છે."
        },
        {
            "id": 41,
            "storyId": "34",
            "title": "બે મિત્ર અને વાંદરો",
            "image": require('../../assets/storyDetailsImage/storyDetails27.png'),
            "description": "  બે શ્રેષ્ઠ મિત્રો, એલેક્સ અને મેક્સ, ઉષ્ણકટિબંધીય જંગલમાં હાઇકિંગ ટ્રિપ પર હતા ત્યારે તેઓ એક રમતિયાળ વાંદરાને મળ્યા.  વાંદરો એક ઝાડથી બીજા ઝાડ પર કૂદકો મારતો હતો અને તેમની સામે રમુજી ચહેરાઓ બનાવી રહ્યો હતો.\n\n  એલેક્સ અને મેક્સે વાંદરાને નજીક લાવવાનો પ્રયાસ કરીને પાછા મૂર્ખ ચહેરાઓ બનાવવાનું શરૂ કર્યું.  વાંદરો રમતનો આનંદ માણી રહ્યો હોય તેવું લાગ્યું અને આખરે ઝાડ પરથી નીચે કૂદીને તેમની તરફ દોડ્યો.\n\n  જેમ જેમ વાંદરો નજીક આવ્યો, એલેક્સ અને મેક્સે તેને પકડવાનો પ્રયાસ કર્યો, પરંતુ વાંદરો તેમના માટે ખૂબ જ ઝડપી હતો.  તે તેમની આસપાસ વર્તુળોમાં દોડતો હતો, જેનાથી તેઓ ચક્કર આવતા હતા અને બેકાબૂપણે હસતા હતા.\n\n  અચાનક, વાંદરો મેક્સના માથા પર કૂદી પડ્યો અને તેના વાળ ખેંચવા લાગ્યો.  મેક્સ ચીસો પાડવા લાગ્યો અને આસપાસ દોડવા લાગ્યો, વાંદરાને હલાવવાનો પ્રયાસ કર્યો.  પરંતુ વાંદરાએ મેક્સના વાળનો સ્વિંગ તરીકે ઉપયોગ કરીને ચુસ્તપણે પકડી રાખ્યું.\n\n  એલેક્સ તેના મિત્રને વાંદરો દ્વારા આજુબાજુ ફરતો જોઈને હસવાનું રોકી શક્યો નહીં.  આખરે, વાંદરો કંટાળી ગયો અને ભાગી ગયો, મેક્સને વાળના થોડા સેર ખૂટે છે.\n\n  જોકે મેક્સ થોડો શરમ અનુભવતો હતો, પરંતુ તેઓ મદદ કરી શક્યા ન હતા પરંતુ તેઓએ હમણાં જ શેર કરેલા રમુજી અનુભવ પર હસ્યા.  તેઓએ તેમનો પ્રવાસ ચાલુ રાખ્યો, હજુ પણ રમતિયાળ વાંદરાઓ અને તેમની મૂર્ખ હરકતો પર હસ્યા"
        },
        {
            "id": 42,
            "storyId": "35",
            "title": "પિકનિક મિત્ર સાથે",
            "image": require('../../assets/storyDetailsImage/storyDetails28.png'),
            "description": "  મિત્રો સાથે પિકનિક વિશે અહીં રમુજી વાર્તા છે: \n\n  એક સન્ની દિવસે, મિત્રોના જૂથે સ્થાનિક પાર્કમાં પિકનિક કરવાનું નક્કી કર્યું.  તેઓએ સ્વાદિષ્ટ ખોરાક અને પીણાંથી ભરેલી ટોપલી પેક કરી અને એક મોટા વૃક્ષની નીચે ઘાસવાળા વિસ્તારમાં આરામદાયક પિકનિક સ્થળ બનાવ્યું.\n\n  જ્યારે તેઓ તેમના ખોરાકનો આનંદ માણી રહ્યા હતા અને ગપસપ કરી રહ્યા હતા, ત્યારે તેઓએ કીડીઓના જૂથને આખા ધાબળા અને ખોરાક પર રખડતા જોયા.  તેઓ ઝડપથી સમજી ગયા કે તેઓએ તેમની પિકનિક કીડીની ટેકરીની ટોચ પર ગોઠવી છે.\n\n  એક મિત્ર, જે ખાસ કરીને તોફાની અનુભવી રહ્યો હતો, તેણે એન્ટ સોકર ની રમત શરૂ કરવાનું સૂચન કર્યું.  રમતના નિયમો સરળ હતા: દરેક વ્યક્તિએ કીડીઓને ધાબળામાંથી ઉડાડવા માટે અને લાકડીઓથી બનેલા નાના ગોલમાં સ્ટ્રોનો ઉપયોગ કરવો પડતો હતો.\n\n  શરૂઆતમાં, દરેક ભાગ લેવા માટે અચકાતા હતા, પરંતુ જેમ જેમ તેઓએ કીડીઓ ફૂંકવાનું શરૂ કર્યું, તેઓ હસવાનું રોકી શક્યા નહીં.  દરેક વ્યક્તિ સૌથી વધુ ગોલ કરવાનો પ્રયાસ કરી રહી હોવાથી આ રમત વધુ ને વધુ સ્પર્ધાત્મક બની.\n\n  અચાનક, પવનના એક ઝાપટાએ જમીન પરથી પિકનિક ધાબળો ઉડાવી દીધો, અને દરેક જગ્યાએ ખાદ્યપદાર્થો ઉડતા મોકલ્યા.  મિત્રો આઘાત અને અકળામણમાં મુકાઈ ગયા હતા કારણ કે તેઓ સમજી ગયા હતા કે તેઓ પાર્કમાં જનારા અન્ય લોકોની સામે પોતાનો તમાશો બનાવી રહ્યા છે.\n\n  અરાજકતા અને ગડબડ હોવા છતાં, મિત્રો મદદ કરી શક્યા નહીં પરંતુ પરિસ્થિતિની વાહિયાતતા પર હસ્યા.  તેઓએ ઝડપથી તેમની વાસણ સાફ કરી અને ફરીથી ક્યારેય કીડી સોકર નહીં રમવાનું વચન આપ્યું, પરંતુ તેઓ હજુ પણ તે દિવસે ખૂબ જ સુંદર યાદો અને ઘણાં હાસ્ય સાથે પાછા જુએ છે."
        },
    ]
    useEffect(() => {
        if (params.id) {
            const filterStory = stories?.find((story) => story?.storyId === params.id);
            setStoryDetails(filterStory);
        }
    }, [params.id]);
    return (
        <ImageBackground source={require('../../assets/seconScreen.png')} style={styles.bgstyle}>
            <ScrollView contentContainerStyle={styles.scrollViewContent}>
                {
                    storyDetails?.description ?
                        <View style={styles.itemContainer}>
                            <Image source={storyDetails?.image} />
                            <Text style={styles.descriptionText} className="mt-3">{storyDetails?.description}</Text>
                        </View>
                        :
                        <View style={styles.itemContainer}>
                            <Text className="text-center">કોઈ વિગતો મળી નથી</Text>
                        </View>
                }
            </ScrollView>
        </ImageBackground>
    );
};

const styles = StyleSheet.create({
    bgstyle: {
        flex: 1,
        resizeMode: 'cover',
        justifyContent: 'center',
        alignItems: 'center',
    },
    scrollViewContent: {
        flexGrow: 1,
        justifyContent: 'center',
        alignItems: 'center',
        width: '100%',
        paddingVertical: 20,
        paddingHorizontal: 10,
    },
    itemContainer: {
        backgroundColor: '#F9E79F',
        borderRadius: 5,
        padding: 15,
        width: windowWidth - 20,
        maxWidth: 400,
    },
    descriptionText: {
        fontSize: 16,
        textAlign: 'justify',
        lineHeight: 24, // Adjust line height as needed
    },
});

export default StoryDetails;
